Namespace:   Autodesk.Revit.UI.Macros
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public override RibbonPanel CreateRibbonPanel(
	Tab tab,
	string panelName
)
  Visual Basic
Public Overrides Function CreateRibbonPanel ( _
	tab As Tab, _
	panelName As String _
) As RibbonPanel
  Visual C++
public:
virtual RibbonPanel^ CreateRibbonPanel(
	Tab tab,
	String^ panelName
) override
 Parameters
  tab
 Type:  Autodesk.Revit.UI Tab
  panelName
 Type:  System String
 See Also
  ApplicationEntryPoint Class
  CreateRibbonPanel Overload
  Autodesk.Revit.UI.Macros Namespace